<?php

use Illuminate\Database\Seeder;

class NationalHolidaysTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('national_holidays')->insert([
            
            [ 'name' => '元日', 'date' =>   '2017-01-01' ],
            [ 'name' => '元日 振替休日', 'date' =>   '2017-01-02' ],
            [ 'name' => '成人の日', 'date' =>   '2017-01-09' ],
            [ 'name' => '建国記念の日', 'date' =>   '2017-02-11' ],
            [ 'name' => '春分の日', 'date' =>   '2017-03-20' ],
            [ 'name' => '昭和の日', 'date' =>   '2017-04-29' ],
            [ 'name' => '憲法記念日', 'date' =>   '2017-05-03' ],
            [ 'name' => 'みどりの日', 'date' =>   '2017-05-04' ],
            [ 'name' => 'こどもの日', 'date' =>   '2017-05-05' ],
            [ 'name' => '海の日', 'date' =>   '2017-07-17' ],
            [ 'name' => '山の日', 'date' =>   '2017-08-11' ],
            [ 'name' => '敬老の日', 'date' =>   '2017-09-18' ],
            [ 'name' => '秋分の日', 'date' =>   '2017-09-23' ],
            [ 'name' => '体育の日', 'date' =>   '2017-10-09' ],
            [ 'name' => '文化の日', 'date' =>   '2017-11-03' ],
            [ 'name' => '勤労感謝の日', 'date' =>   '2017-11-23' ],
            [ 'name' => '天皇誕生日', 'date' =>   '2017-12-23' ],
            [ 'name' => '元日', 'date' =>   '2018-01-01' ],
            [ 'name' => '元日 振替休日', 'date' =>   '2018-01-02' ],
            [ 'name' => '成人の日', 'date' =>   '2018-01-09' ],
            [ 'name' => '建国記念の日', 'date' =>   '2018-02-11' ],
            [ 'name' => '春分の日', 'date' =>   '2018-03-20' ],
            [ 'name' => '昭和の日', 'date' =>   '2018-04-29' ],
            [ 'name' => '憲法記念日', 'date' =>   '2018-05-03' ],
            [ 'name' => 'みどりの日', 'date' =>   '2018-05-04' ],
            [ 'name' => 'こどもの日', 'date' =>   '2018-05-05' ],
            [ 'name' => '海の日', 'date' =>   '2018-07-17' ],
            [ 'name' => '山の日', 'date' =>   '2018-08-11' ],
            [ 'name' => '敬老の日', 'date' =>   '2018-09-18' ],
            [ 'name' => '秋分の日', 'date' =>   '2018-09-23' ],
            [ 'name' => '体育の日', 'date' =>   '2018-10-09' ],
            [ 'name' => '文化の日', 'date' =>   '2018-11-03' ],
            [ 'name' => '勤労感謝の日', 'date' =>   '2018-11-23' ],
            [ 'name' => '天皇誕生日', 'date' =>   '2018-12-23' ],
            
        ]);
    }
}
